package com.example.myapplication;

import androidx.annotation.Nullable;
import androidx.appcompat.app.AppCompatActivity;
import com.squareup.picasso.Picasso;

import android.content.Context;
import android.content.Intent;
import android.graphics.Bitmap;
import android.graphics.Color;
import android.graphics.drawable.BitmapDrawable;
import android.os.Bundle;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.widget.BaseAdapter;
import android.widget.ImageView;
import android.widget.LinearLayout;
import android.widget.ListView;
import android.widget.TextView;

import org.jetbrains.annotations.Contract;

import java.util.ArrayList;
import java.util.HashMap;
import java.util.LinkedHashMap;
import java.util.List;
import java.util.Random;

public class MainActivity extends AppCompatActivity {
    ListView listView;
    HashMap<String, String>hashMap = new HashMap<>();
    ArrayList<HashMap<String,String>> arrayList = new ArrayList<>();



    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main);
        listView = findViewById(R.id.listView);


        createTable();



        MyAdapter myAdapter = new MyAdapter();
         listView.setAdapter(myAdapter);
    }

    // ================ Akhane amra adapter Class dorbo ++++
    //++++++++++++++++++++++++++++++++=============

    private class MyAdapter extends BaseAdapter{
        @Override
        public int getCount() {
            return arrayList.size();
        }

        @Override
        public Object getItem(int i) {
            return null;
        }

        @Override
        public long getItemId(int i) {
            return 0;
        }
        @Nullable
        @Contract(pure = true)

        @Override
        public View getView(int position, View view, ViewGroup viewGroup) {
            LayoutInflater inflater = (LayoutInflater) getSystemService(Context.LAYOUT_INFLATER_SERVICE);
            View myView = inflater.inflate(R.layout.item, viewGroup,false);

            //Akhane sobaike poricoi kore debo
            ImageView itemCover = myView.findViewById(R.id.itemCover);
            TextView tvCat = myView.findViewById(R.id.tvCat);
            TextView itemTitle = myView.findViewById(R.id.itemTitle);
            TextView itemDes = myView.findViewById(R.id.itemDes);
            LinearLayout layItem  = myView.findViewById(R.id.layItem);



            HashMap<String, String> hashMap = arrayList.get(position);
            String cat = hashMap.get("Cat");
            String Image_url = hashMap.get("Image_url");
            String Title = hashMap.get("Title");
            String Description = hashMap.get("Description");

            Picasso.get().load(Image_url)
                    .placeholder(R.drawable.cvr)
                    .into(itemCover);




            tvCat.setText(cat);
            itemTitle.setText(Title);
            itemDes.setText(Description);

            Random rnd = new Random();
            int color = Color.argb(255, rnd.nextInt(256), rnd.nextInt(256), rnd.nextInt(256));
            tvCat.setBackgroundColor(color);

            layItem.setOnClickListener(new View.OnClickListener() {
                @Override
                public void onClick(View view) {

                    NewsDetails.TITLE = Title;
                    NewsDetails.DESCRIPTION = Description;

                    Bitmap bitmap = ((BitmapDrawable) itemCover.getDrawable()).getBitmap();
                    NewsDetails.MY_BITMAP = bitmap;

                    startActivity(new Intent(MainActivity.this,NewsDetails.class));

                }
            });

            return myView;
        }
    }


    //+++++++++=====================***************+++++=========
    //+++++++++=====================***************+++++=========
    //+++++++++=====================***************+++++=========

    private void createTable(){

        hashMap = new HashMap<>();
        hashMap.put("Cat","TECH");
        hashMap.put("Image_url","https://techzoom.tv/wp-content/uploads/2024/01/%E0%A6%87%E0%A6%A8%E0%A7%8D%E0%A6%9F%E0%A6%BE%E0%A6%B0%E0%A6%A8%E0%A7%87%E0%A6%9F-%E0%A6%AA%E0%A7%8D%E0%A6%AF%E0%A6%BE%E0%A6%95%E0%A7%87%E0%A6%9C%E0%A7%87-%E0%A6%85%E0%A6%AC%E0%A7%8D%E0%A6%AF%E0%A6%AC%E0%A6%B9%E0%A7%83%E0%A6%A4-%E0%A6%A1%E0%A6%BE%E0%A6%9F%E0%A6%BE-%E0%A6%AC%E0%A7%8D%E0%A6%AF%E0%A6%AC%E0%A6%B9%E0%A6%BE%E0%A6%B0%E0%A7%87%E0%A6%B0-%E0%A6%B8%E0%A7%80%E0%A6%AE%E0%A6%BE-%E0%A6%89%E0%A6%A0%E0%A6%B2-750x375.jpg");
        hashMap.put("Title","ইন্টারনেট প্যাকেজে অব্যবহৃত ডাটা ব্যবহারের সীমা উঠল");
        hashMap.put("Description","মেয়াদ শেষে অব্যবহৃত মোবাইল ইন্টারনেট ডাটা পুনরায় ব্যবহারে নতুন নির্দেশনা জারি করল বাংলাদেশ টেলিযোগাযোগ নিয়ন্ত্রণ কমিশন (বিআরটিসি)। এখন থেকে একজন গ্রাহকরা অব্যবহৃত ইন্টারনেট ডাটার সম্পূর্ণটুকুই ক্যারি ফরওয়ার্ড বা নতুন করে ব্যবহার করতে পারবেন। তবে এজন্য বর্তমান কেনা প্যাকেজই মেয়াদ শেষ হওয়ার আগে কিনতে হবে। তবেই আগের অব্যবহৃত ইন্টারনেট ডাটা পুনরায় ব্যবহার করা যাবে।\n" +
                "\n" +
                "২০২৩ সালের ১৫ অক্টোবর বিটিআরসি কর্তৃক জারিকৃত মোবাইল ফোন অপারেটরসমূহের ডাটা এবং ডাটা সংশ্লিষ্ট প্যাকেজ সম্পর্কিত নির্দেশিকায় বলা হয়েছিল, একজন গ্রাহক সর্বোচ্চ ৫০ জিবি পর্যন্ত ডাটা ক্যারি ফরওয়ার্ড করতে পারবেন। গ্রাহক স্বার্থ বিবেচনায় উক্ত নির্দেশনা সংশোধন করে ৫০ জিবি ক্যারি ফরওয়ার্ডের সীমা বাতিল করেছে নিয়ন্ত্রক সংস্থা।\n" +
                "\n" +
                "বৃহস্পতিবার বিকালে বিটিআরসি থেকে পাঠানো এক সংবাদ বিজ্ঞপ্তিতে এই তথ্য জানানো হয়েছে।\n" +
                "\n" +
                "নতুন নিয়ম অনুযায়ী একজন গ্রাহকের ডাটা প্যাকেজের মেয়াদান্তে অব্যবহৃত ডাটা (বোনাসসহ) ক্যারি ফরওয়ার্ড হবে। যদি গ্রাহক উক্ত প্যাকেজের মেয়াদ শেষ হবার পূর্বেই একই ডাটা প্যাকেজ (ভিন্ন ভিন্ন মেয়াদসহ) ক্রয় করেন।\n" +
                "\n" +
                "ইতিমধ্যে সকল মোবাইল অপারেটরসমূহকে এ নির্দেশনা দিয়েছে বিটিআরসি।");

        arrayList.add(hashMap);


        hashMap = new HashMap<>();
        hashMap.put("Cat","TECH");
        hashMap.put("Image_url","https://techzoom.tv/wp-content/uploads/2023/03/%E0%A6%B6%E0%A6%BE%E0%A6%93%E0%A6%AE%E0%A6%BF-%E0%A6%86%E0%A6%A8%E0%A6%B2-%E0%A6%A8%E0%A6%A4%E0%A7%81%E0%A6%A8-%E0%A6%B8%E0%A7%8D%E0%A6%AE%E0%A6%BE%E0%A6%B0%E0%A7%8D%E0%A6%9F%E0%A6%93%E0%A7%9F%E0%A6%BE%E0%A6%9A.jpg");
        hashMap.put("Title","হ্যাকার থেকে স্মার্টওয়াচ রক্ষা করবেন যেভাবে");
        hashMap.put("Description","স্মার্টওয়াচকে বলা হয় স্মার্টফোনের বিকল্প। অর্থাৎ স্মার্টফোনে যত কাজ করা যায় তার প্রায় সবই করা যায় স্মার্টওয়াচে। সোশ্যাল মিডিয়া ব্যবহার থেকে শুরু করে ব্লুটুথ কলিং, গান শোনা, স্বাস্থ্যের খেয়াল রাখা কি করে না স্মার্টওয়াচ। আপনার এতো কাজের স্মার্টওয়াচটিকে হ্যাকাররেয়া রেহাই দিচ্ছে না।\n" +
                "\n" +
                "তবে অনেকেই বলেন সস্তার স্মার্টওয়াচে এর ঝুঁকি অনেক বেশি। জানলে অবাক হবেন, দামি অ্যাপল ওয়াচ স্মার্টওয়াচেও রয়েছে হ্যাকিংয়ের ঝুঁকি। স্মার্টওয়াচে ফিটনেস, ফোন কল এবং মেসেজের মতো তথ্যের অ্যাক্সেস রয়েছে। তাই এটিকে নিরাপদ রাখা খুবই জরুরি।\n" +
                "\n" +
                "\n" +
                "জেনে নিন কীভাবে বুঝবেন স্মার্টওয়াচ হ্যাক হয়েছে-\n" +
                "ব্লুটুথ স্মার্টওয়াচ ব্লুটুথ লো এনার্জি নামে একটি প্রযুক্তির মাধ্যমে আপনার স্মার্টফোনের সঙ্গে কানেক্ট করে। এই প্রযুক্তিটি ডেটা ট্রান্সমিশনের জন্য বিভিন্ন চ্যানেল ব্যবহার করে। ব্লুটুথ এবং ব্লুটুথ লো এনার্জির মধ্যে প্রধান পার্থক্য হল যে এটি নিয়মিত তুলনায় কম শক্তি ব্যবহার করে। ফলে হ্যাক হওয়ার সম্ভবনা বেশি থাকে।" +
                "যদি মনে করেন, স্মার্টওয়াচের চার্জ আগের তুলনায় কম থাকছে। তাহলে সতর্ক হয়ে যান। স্মার্টওয়াচগুলো অ্যাপ কেন্দ্রিক। বিভিন্ন কন্ট্রোলার অ্যাপ দ্বারা কাজ করে। ফলে হ্যাকাররা অ্যাপগুলোকে হ্যাক করে। ফলে তখন স্মার্টওয়াচের সব কন্ট্রোল তাদের হাতে চলে যায়।\n" +
                "\n" +
                "জেনে নিন হ্যাকার থেকে স্মার্টওয়াচ বাঁচাতে কী কী করবেন-\n" +
                ">> যে কোনো স্মার্টওয়াচ কেনার আগে আপনার উচিত তার সম্পর্কে গবেষণা করা।\n" +
                ">> নন-ব্র্যান্ডের স্মার্টওয়াচ না কেনাই ভালো। এতে আপনার ঘড়িটি হ্যাক হতে পারে। কারণ এতে তেমন কোনো সিকিওরিটি ফিচার থাকে না।\n" +
                ">> ডিভাইসের ফার্মওয়্যার আপডেট রাখতে হবে।\n" +
                ">> অজানা ওয়েবসাইট থেকে অ্যাপ ডাউনলোড করবেন না। তাও আবার এমন সব অ্যাপ যা আপনার স্মার্টওয়াচে কানেক্ট হবে।\n" +
                ">> যদি আপনার স্মার্টওয়াচে ওয়াই-ফাইয়ের ফিচার থাকে। তাহলে কখনোই ঘড়িটিকে পাবলিক ওয়াইফাইয়ের সঙ্গে কানেক্ট করবেন না।\n" +
                ">> স্মার্টওয়াচটিকে ঠিকভাবে চালানোর জন্য ফোনে যে অ্যাপটিকে ডাউনলোড করে রেখেছেন, সেটিকে সময়ে সময়ে আপডেট করুন। নাহলে স্মার্টওয়াচ হ্যাক হওয়ার সম্ভাবনা বেড়ে যায়।");

        arrayList.add(hashMap);


        hashMap = new HashMap<>();
        hashMap.put("Cat","TECH");
        hashMap.put("Image_url","https://www.jugantor.com/assets/news_photos/2024/01/26/image-767485-1706249412.jpg");
        hashMap.put("Title","বিয়ের পর নতুন সিদ্ধান্ত নিলেন পরিণীতি");
        hashMap.put("Description","গত বছরই আপ নেতা রাঘব চাড্ডার সঙ্গে বিয়ের পিঁড়িতে বসেছেন বলিউড অভিনেত্রী পরিণীতি চোপড়া। শাস্ত্রীয় সংগীতের চর্চা করে বড় হয়েছেন অভিনেত্রী। সম্প্রতি একটি বিখ্যাত বিনোদন সংস্থা এন্টারটেইনমেন্ট কনসালট্যান্ট এলএলপির সঙ্গে চুক্তি করেছেন তিনি।\n" +
                "বৃহস্পতিবার একটি ইনস্টাগ্রাম পোস্টের ক্যাপশনে পরিণীতি লিখেছেন, ‘সংগীত আমার কাছে সবসময়ই আমার আনন্দের জায়গা। আমি বিশ্বব্যাপী অগণিত সংগীতজ্ঞদের মঞ্চে পারফরম করতে দেখেছি এবং এখন অবশেষে সেই বিশ্বের অংশ হওয়ার সময় এসেছে’।\n" +
                "\n" +
                "তিনি আরও যোগ করেছেন, ‘আমি আমার জীবনের একটি সম্পূর্ণ নতুন অধ্যায় শুরু করার জন্য খুব ভাগ্যবান, আশীর্বাদ এবং চাপ অনুভব করছি। আমি এই সংগীত যাত্রা শুরু করতে কতটা উত্তেজিত তা আমি সত্যিই বলে বোঝাতে পারব না। একটি যাত্রা যা আমাকে একসঙ্গে দুটি ক্যারিয়ার করার সুযোগ করে দেয়! মজার কিন্তু! অজানাকে আলিঙ্গন করা এবং আমার সব ভয়ের মুখোমুখি হওয়া এবং গান গেয়ে ডেবিউ করা’।\n" +
                "\n" +
                "পরিণীতি লিখেছেন, ‘এই বছর আপনাদের জন্য বেশ কিছু আশ্চর্যজনক জিনিস রয়েছে। আশা করি আপনারাও এটার জন্য আমার মতোই উত্তেজিত’।\n" +
                "ঐশ্বরিয়ার বিচ্ছেদ গুঞ্জন, রহস্যজনক পোস্ট অভিষেকের\n" +
                "\n" +
                "দ্বিতীয় বিয়ে করলেন স্বাগতা\n" +
                "\n" +
                "বছর ৩৫-এর অভিনেত্রী সংগীত জগতের সঙ্গে আগে থেকেই পরিচিত। কারণ ২০১৭ সালে ‘মেরি পেয়ারি বিন্দু’ ছবিতে ‘মানা কে হাম ইয়ার নেহি’ গানটি গেয়েছিলেন তিনি।\n");

        arrayList.add(hashMap);


        hashMap = new HashMap<>();
        hashMap.put("Cat","TECH");
        hashMap.put("Image_url","https://techzoom.tv/wp-content/uploads/2024/01/%E0%A6%87%E0%A6%A8%E0%A7%8D%E0%A6%9F%E0%A6%BE%E0%A6%B0%E0%A6%A8%E0%A7%87%E0%A6%9F-%E0%A6%AA%E0%A7%8D%E0%A6%AF%E0%A6%BE%E0%A6%95%E0%A7%87%E0%A6%9C%E0%A7%87-%E0%A6%85%E0%A6%AC%E0%A7%8D%E0%A6%AF%E0%A6%AC%E0%A6%B9%E0%A7%83%E0%A6%A4-%E0%A6%A1%E0%A6%BE%E0%A6%9F%E0%A6%BE-%E0%A6%AC%E0%A7%8D%E0%A6%AF%E0%A6%AC%E0%A6%B9%E0%A6%BE%E0%A6%B0%E0%A7%87%E0%A6%B0-%E0%A6%B8%E0%A7%80%E0%A6%AE%E0%A6%BE-%E0%A6%89%E0%A6%A0%E0%A6%B2-750x375.jpg");
        hashMap.put("Title","ইন্টারনেট প্যাকেজে অব্যবহৃত ডাটা ব্যবহারের সীমা উঠল");
        hashMap.put("Description","মেয়াদ শেষে অব্যবহৃত মোবাইল ইন্টারনেট ডাটা পুনরায় ব্যবহারে নতুন নির্দেশনা জারি করল বাংলাদেশ টেলিযোগাযোগ নিয়ন্ত্রণ কমিশন (বিআরটিসি)। এখন থেকে একজন গ্রাহকরা অব্যবহৃত ইন্টারনেট ডাটার সম্পূর্ণটুকুই ক্যারি ফরওয়ার্ড বা নতুন করে ব্যবহার করতে পারবেন। তবে এজন্য বর্তমান কেনা প্যাকেজই মেয়াদ শেষ হওয়ার আগে কিনতে হবে। তবেই আগের অব্যবহৃত ইন্টারনেট ডাটা পুনরায় ব্যবহার করা যাবে।\n" +
                "\n" +
                "২০২৩ সালের ১৫ অক্টোবর বিটিআরসি কর্তৃক জারিকৃত মোবাইল ফোন অপারেটরসমূহের ডাটা এবং ডাটা সংশ্লিষ্ট প্যাকেজ সম্পর্কিত নির্দেশিকায় বলা হয়েছিল, একজন গ্রাহক সর্বোচ্চ ৫০ জিবি পর্যন্ত ডাটা ক্যারি ফরওয়ার্ড করতে পারবেন। গ্রাহক স্বার্থ বিবেচনায় উক্ত নির্দেশনা সংশোধন করে ৫০ জিবি ক্যারি ফরওয়ার্ডের সীমা বাতিল করেছে নিয়ন্ত্রক সংস্থা।\n" +
                "\n" +
                "বৃহস্পতিবার বিকালে বিটিআরসি থেকে পাঠানো এক সংবাদ বিজ্ঞপ্তিতে এই তথ্য জানানো হয়েছে।\n" +
                "\n" +
                "নতুন নিয়ম অনুযায়ী একজন গ্রাহকের ডাটা প্যাকেজের মেয়াদান্তে অব্যবহৃত ডাটা (বোনাসসহ) ক্যারি ফরওয়ার্ড হবে। যদি গ্রাহক উক্ত প্যাকেজের মেয়াদ শেষ হবার পূর্বেই একই ডাটা প্যাকেজ (ভিন্ন ভিন্ন মেয়াদসহ) ক্রয় করেন।\n" +
                "\n" +
                "ইতিমধ্যে সকল মোবাইল অপারেটরসমূহকে এ নির্দেশনা দিয়েছে বিটিআরসি।");

        arrayList.add(hashMap);

        hashMap = new HashMap<>();
        hashMap.put("Cat","TECH");
        hashMap.put("Image_url","https://techzoom.tv/wp-content/uploads/2024/01/%E0%A6%87%E0%A6%A8%E0%A7%8D%E0%A6%9F%E0%A6%BE%E0%A6%B0%E0%A6%A8%E0%A7%87%E0%A6%9F-%E0%A6%AA%E0%A7%8D%E0%A6%AF%E0%A6%BE%E0%A6%95%E0%A7%87%E0%A6%9C%E0%A7%87-%E0%A6%85%E0%A6%AC%E0%A7%8D%E0%A6%AF%E0%A6%AC%E0%A6%B9%E0%A7%83%E0%A6%A4-%E0%A6%A1%E0%A6%BE%E0%A6%9F%E0%A6%BE-%E0%A6%AC%E0%A7%8D%E0%A6%AF%E0%A6%AC%E0%A6%B9%E0%A6%BE%E0%A6%B0%E0%A7%87%E0%A6%B0-%E0%A6%B8%E0%A7%80%E0%A6%AE%E0%A6%BE-%E0%A6%89%E0%A6%A0%E0%A6%B2-750x375.jpg");
        hashMap.put("Title","ইন্টারনেট প্যাকেজে অব্যবহৃত ডাটা ব্যবহারের সীমা উঠল");
        hashMap.put("Description","মেয়াদ শেষে অব্যবহৃত মোবাইল ইন্টারনেট ডাটা পুনরায় ব্যবহারে নতুন নির্দেশনা জারি করল বাংলাদেশ টেলিযোগাযোগ নিয়ন্ত্রণ কমিশন (বিআরটিসি)। এখন থেকে একজন গ্রাহকরা অব্যবহৃত ইন্টারনেট ডাটার সম্পূর্ণটুকুই ক্যারি ফরওয়ার্ড বা নতুন করে ব্যবহার করতে পারবেন। তবে এজন্য বর্তমান কেনা প্যাকেজই মেয়াদ শেষ হওয়ার আগে কিনতে হবে। তবেই আগের অব্যবহৃত ইন্টারনেট ডাটা পুনরায় ব্যবহার করা যাবে।\n" +
                "\n" +
                "২০২৩ সালের ১৫ অক্টোবর বিটিআরসি কর্তৃক জারিকৃত মোবাইল ফোন অপারেটরসমূহের ডাটা এবং ডাটা সংশ্লিষ্ট প্যাকেজ সম্পর্কিত নির্দেশিকায় বলা হয়েছিল, একজন গ্রাহক সর্বোচ্চ ৫০ জিবি পর্যন্ত ডাটা ক্যারি ফরওয়ার্ড করতে পারবেন। গ্রাহক স্বার্থ বিবেচনায় উক্ত নির্দেশনা সংশোধন করে ৫০ জিবি ক্যারি ফরওয়ার্ডের সীমা বাতিল করেছে নিয়ন্ত্রক সংস্থা।\n" +
                "\n" +
                "বৃহস্পতিবার বিকালে বিটিআরসি থেকে পাঠানো এক সংবাদ বিজ্ঞপ্তিতে এই তথ্য জানানো হয়েছে।\n" +
                "\n" +
                "নতুন নিয়ম অনুযায়ী একজন গ্রাহকের ডাটা প্যাকেজের মেয়াদান্তে অব্যবহৃত ডাটা (বোনাসসহ) ক্যারি ফরওয়ার্ড হবে। যদি গ্রাহক উক্ত প্যাকেজের মেয়াদ শেষ হবার পূর্বেই একই ডাটা প্যাকেজ (ভিন্ন ভিন্ন মেয়াদসহ) ক্রয় করেন।\n" +
                "\n" +
                "ইতিমধ্যে সকল মোবাইল অপারেটরসমূহকে এ নির্দেশনা দিয়েছে বিটিআরসি।");

        arrayList.add(hashMap);

        hashMap = new HashMap<>();
        hashMap.put("Cat","TECH");
        hashMap.put("Image_url","https://techzoom.tv/wp-content/uploads/2024/01/%E0%A6%87%E0%A6%A8%E0%A7%8D%E0%A6%9F%E0%A6%BE%E0%A6%B0%E0%A6%A8%E0%A7%87%E0%A6%9F-%E0%A6%AA%E0%A7%8D%E0%A6%AF%E0%A6%BE%E0%A6%95%E0%A7%87%E0%A6%9C%E0%A7%87-%E0%A6%85%E0%A6%AC%E0%A7%8D%E0%A6%AF%E0%A6%AC%E0%A6%B9%E0%A7%83%E0%A6%A4-%E0%A6%A1%E0%A6%BE%E0%A6%9F%E0%A6%BE-%E0%A6%AC%E0%A7%8D%E0%A6%AF%E0%A6%AC%E0%A6%B9%E0%A6%BE%E0%A6%B0%E0%A7%87%E0%A6%B0-%E0%A6%B8%E0%A7%80%E0%A6%AE%E0%A6%BE-%E0%A6%89%E0%A6%A0%E0%A6%B2-750x375.jpg");
        hashMap.put("Title","ইন্টারনেট প্যাকেজে অব্যবহৃত ডাটা ব্যবহারের সীমা উঠল");
        hashMap.put("Description","মেয়াদ শেষে অব্যবহৃত মোবাইল ইন্টারনেট ডাটা পুনরায় ব্যবহারে নতুন নির্দেশনা জারি করল বাংলাদেশ টেলিযোগাযোগ নিয়ন্ত্রণ কমিশন (বিআরটিসি)। এখন থেকে একজন গ্রাহকরা অব্যবহৃত ইন্টারনেট ডাটার সম্পূর্ণটুকুই ক্যারি ফরওয়ার্ড বা নতুন করে ব্যবহার করতে পারবেন। তবে এজন্য বর্তমান কেনা প্যাকেজই মেয়াদ শেষ হওয়ার আগে কিনতে হবে। তবেই আগের অব্যবহৃত ইন্টারনেট ডাটা পুনরায় ব্যবহার করা যাবে।\n" +
                "\n" +
                "২০২৩ সালের ১৫ অক্টোবর বিটিআরসি কর্তৃক জারিকৃত মোবাইল ফোন অপারেটরসমূহের ডাটা এবং ডাটা সংশ্লিষ্ট প্যাকেজ সম্পর্কিত নির্দেশিকায় বলা হয়েছিল, একজন গ্রাহক সর্বোচ্চ ৫০ জিবি পর্যন্ত ডাটা ক্যারি ফরওয়ার্ড করতে পারবেন। গ্রাহক স্বার্থ বিবেচনায় উক্ত নির্দেশনা সংশোধন করে ৫০ জিবি ক্যারি ফরওয়ার্ডের সীমা বাতিল করেছে নিয়ন্ত্রক সংস্থা।\n" +
                "\n" +
                "বৃহস্পতিবার বিকালে বিটিআরসি থেকে পাঠানো এক সংবাদ বিজ্ঞপ্তিতে এই তথ্য জানানো হয়েছে।\n" +
                "\n" +
                "নতুন নিয়ম অনুযায়ী একজন গ্রাহকের ডাটা প্যাকেজের মেয়াদান্তে অব্যবহৃত ডাটা (বোনাসসহ) ক্যারি ফরওয়ার্ড হবে। যদি গ্রাহক উক্ত প্যাকেজের মেয়াদ শেষ হবার পূর্বেই একই ডাটা প্যাকেজ (ভিন্ন ভিন্ন মেয়াদসহ) ক্রয় করেন।\n" +
                "\n" +
                "ইতিমধ্যে সকল মোবাইল অপারেটরসমূহকে এ নির্দেশনা দিয়েছে বিটিআরসি।");

        arrayList.add(hashMap);

        hashMap = new HashMap<>();
        hashMap.put("Cat","TECH");
        hashMap.put("Image_url","https://techzoom.tv/wp-content/uploads/2024/01/%E0%A6%87%E0%A6%A8%E0%A7%8D%E0%A6%9F%E0%A6%BE%E0%A6%B0%E0%A6%A8%E0%A7%87%E0%A6%9F-%E0%A6%AA%E0%A7%8D%E0%A6%AF%E0%A6%BE%E0%A6%95%E0%A7%87%E0%A6%9C%E0%A7%87-%E0%A6%85%E0%A6%AC%E0%A7%8D%E0%A6%AF%E0%A6%AC%E0%A6%B9%E0%A7%83%E0%A6%A4-%E0%A6%A1%E0%A6%BE%E0%A6%9F%E0%A6%BE-%E0%A6%AC%E0%A7%8D%E0%A6%AF%E0%A6%AC%E0%A6%B9%E0%A6%BE%E0%A6%B0%E0%A7%87%E0%A6%B0-%E0%A6%B8%E0%A7%80%E0%A6%AE%E0%A6%BE-%E0%A6%89%E0%A6%A0%E0%A6%B2-750x375.jpg");
        hashMap.put("Title","ইন্টারনেট প্যাকেজে অব্যবহৃত ডাটা ব্যবহারের সীমা উঠল");
        hashMap.put("Description","মেয়াদ শেষে অব্যবহৃত মোবাইল ইন্টারনেট ডাটা পুনরায় ব্যবহারে নতুন নির্দেশনা জারি করল বাংলাদেশ টেলিযোগাযোগ নিয়ন্ত্রণ কমিশন (বিআরটিসি)। এখন থেকে একজন গ্রাহকরা অব্যবহৃত ইন্টারনেট ডাটার সম্পূর্ণটুকুই ক্যারি ফরওয়ার্ড বা নতুন করে ব্যবহার করতে পারবেন। তবে এজন্য বর্তমান কেনা প্যাকেজই মেয়াদ শেষ হওয়ার আগে কিনতে হবে। তবেই আগের অব্যবহৃত ইন্টারনেট ডাটা পুনরায় ব্যবহার করা যাবে।\n" +
                "\n" +
                "২০২৩ সালের ১৫ অক্টোবর বিটিআরসি কর্তৃক জারিকৃত মোবাইল ফোন অপারেটরসমূহের ডাটা এবং ডাটা সংশ্লিষ্ট প্যাকেজ সম্পর্কিত নির্দেশিকায় বলা হয়েছিল, একজন গ্রাহক সর্বোচ্চ ৫০ জিবি পর্যন্ত ডাটা ক্যারি ফরওয়ার্ড করতে পারবেন। গ্রাহক স্বার্থ বিবেচনায় উক্ত নির্দেশনা সংশোধন করে ৫০ জিবি ক্যারি ফরওয়ার্ডের সীমা বাতিল করেছে নিয়ন্ত্রক সংস্থা।\n" +
                "\n" +
                "বৃহস্পতিবার বিকালে বিটিআরসি থেকে পাঠানো এক সংবাদ বিজ্ঞপ্তিতে এই তথ্য জানানো হয়েছে।\n" +
                "\n" +
                "নতুন নিয়ম অনুযায়ী একজন গ্রাহকের ডাটা প্যাকেজের মেয়াদান্তে অব্যবহৃত ডাটা (বোনাসসহ) ক্যারি ফরওয়ার্ড হবে। যদি গ্রাহক উক্ত প্যাকেজের মেয়াদ শেষ হবার পূর্বেই একই ডাটা প্যাকেজ (ভিন্ন ভিন্ন মেয়াদসহ) ক্রয় করেন।\n" +
                "\n" +
                "ইতিমধ্যে সকল মোবাইল অপারেটরসমূহকে এ নির্দেশনা দিয়েছে বিটিআরসি।");

        arrayList.add(hashMap);

        hashMap = new HashMap<>();
        hashMap.put("Cat","TECH");
        hashMap.put("Image_url","https://techzoom.tv/wp-content/uploads/2024/01/%E0%A6%87%E0%A6%A8%E0%A7%8D%E0%A6%9F%E0%A6%BE%E0%A6%B0%E0%A6%A8%E0%A7%87%E0%A6%9F-%E0%A6%AA%E0%A7%8D%E0%A6%AF%E0%A6%BE%E0%A6%95%E0%A7%87%E0%A6%9C%E0%A7%87-%E0%A6%85%E0%A6%AC%E0%A7%8D%E0%A6%AF%E0%A6%AC%E0%A6%B9%E0%A7%83%E0%A6%A4-%E0%A6%A1%E0%A6%BE%E0%A6%9F%E0%A6%BE-%E0%A6%AC%E0%A7%8D%E0%A6%AF%E0%A6%AC%E0%A6%B9%E0%A6%BE%E0%A6%B0%E0%A7%87%E0%A6%B0-%E0%A6%B8%E0%A7%80%E0%A6%AE%E0%A6%BE-%E0%A6%89%E0%A6%A0%E0%A6%B2-750x375.jpg");
        hashMap.put("Title","ইন্টারনেট প্যাকেজে অব্যবহৃত ডাটা ব্যবহারের সীমা উঠল");
        hashMap.put("Description","মেয়াদ শেষে অব্যবহৃত মোবাইল ইন্টারনেট ডাটা পুনরায় ব্যবহারে নতুন নির্দেশনা জারি করল বাংলাদেশ টেলিযোগাযোগ নিয়ন্ত্রণ কমিশন (বিআরটিসি)। এখন থেকে একজন গ্রাহকরা অব্যবহৃত ইন্টারনেট ডাটার সম্পূর্ণটুকুই ক্যারি ফরওয়ার্ড বা নতুন করে ব্যবহার করতে পারবেন। তবে এজন্য বর্তমান কেনা প্যাকেজই মেয়াদ শেষ হওয়ার আগে কিনতে হবে। তবেই আগের অব্যবহৃত ইন্টারনেট ডাটা পুনরায় ব্যবহার করা যাবে।\n" +
                "\n" +
                "২০২৩ সালের ১৫ অক্টোবর বিটিআরসি কর্তৃক জারিকৃত মোবাইল ফোন অপারেটরসমূহের ডাটা এবং ডাটা সংশ্লিষ্ট প্যাকেজ সম্পর্কিত নির্দেশিকায় বলা হয়েছিল, একজন গ্রাহক সর্বোচ্চ ৫০ জিবি পর্যন্ত ডাটা ক্যারি ফরওয়ার্ড করতে পারবেন। গ্রাহক স্বার্থ বিবেচনায় উক্ত নির্দেশনা সংশোধন করে ৫০ জিবি ক্যারি ফরওয়ার্ডের সীমা বাতিল করেছে নিয়ন্ত্রক সংস্থা।\n" +
                "\n" +
                "বৃহস্পতিবার বিকালে বিটিআরসি থেকে পাঠানো এক সংবাদ বিজ্ঞপ্তিতে এই তথ্য জানানো হয়েছে।\n" +
                "\n" +
                "নতুন নিয়ম অনুযায়ী একজন গ্রাহকের ডাটা প্যাকেজের মেয়াদান্তে অব্যবহৃত ডাটা (বোনাসসহ) ক্যারি ফরওয়ার্ড হবে। যদি গ্রাহক উক্ত প্যাকেজের মেয়াদ শেষ হবার পূর্বেই একই ডাটা প্যাকেজ (ভিন্ন ভিন্ন মেয়াদসহ) ক্রয় করেন।\n" +
                "\n" +
                "ইতিমধ্যে সকল মোবাইল অপারেটরসমূহকে এ নির্দেশনা দিয়েছে বিটিআরসি।");

        arrayList.add(hashMap);

        hashMap = new HashMap<>();
        hashMap.put("Cat","TECH");
        hashMap.put("Image_url","https://techzoom.tv/wp-content/uploads/2024/01/%E0%A6%87%E0%A6%A8%E0%A7%8D%E0%A6%9F%E0%A6%BE%E0%A6%B0%E0%A6%A8%E0%A7%87%E0%A6%9F-%E0%A6%AA%E0%A7%8D%E0%A6%AF%E0%A6%BE%E0%A6%95%E0%A7%87%E0%A6%9C%E0%A7%87-%E0%A6%85%E0%A6%AC%E0%A7%8D%E0%A6%AF%E0%A6%AC%E0%A6%B9%E0%A7%83%E0%A6%A4-%E0%A6%A1%E0%A6%BE%E0%A6%9F%E0%A6%BE-%E0%A6%AC%E0%A7%8D%E0%A6%AF%E0%A6%AC%E0%A6%B9%E0%A6%BE%E0%A6%B0%E0%A7%87%E0%A6%B0-%E0%A6%B8%E0%A7%80%E0%A6%AE%E0%A6%BE-%E0%A6%89%E0%A6%A0%E0%A6%B2-750x375.jpg");
        hashMap.put("Title","ইন্টারনেট প্যাকেজে অব্যবহৃত ডাটা ব্যবহারের সীমা উঠল");
        hashMap.put("Description","মেয়াদ শেষে অব্যবহৃত মোবাইল ইন্টারনেট ডাটা পুনরায় ব্যবহারে নতুন নির্দেশনা জারি করল বাংলাদেশ টেলিযোগাযোগ নিয়ন্ত্রণ কমিশন (বিআরটিসি)। এখন থেকে একজন গ্রাহকরা অব্যবহৃত ইন্টারনেট ডাটার সম্পূর্ণটুকুই ক্যারি ফরওয়ার্ড বা নতুন করে ব্যবহার করতে পারবেন। তবে এজন্য বর্তমান কেনা প্যাকেজই মেয়াদ শেষ হওয়ার আগে কিনতে হবে। তবেই আগের অব্যবহৃত ইন্টারনেট ডাটা পুনরায় ব্যবহার করা যাবে।\n" +
                "\n" +
                "২০২৩ সালের ১৫ অক্টোবর বিটিআরসি কর্তৃক জারিকৃত মোবাইল ফোন অপারেটরসমূহের ডাটা এবং ডাটা সংশ্লিষ্ট প্যাকেজ সম্পর্কিত নির্দেশিকায় বলা হয়েছিল, একজন গ্রাহক সর্বোচ্চ ৫০ জিবি পর্যন্ত ডাটা ক্যারি ফরওয়ার্ড করতে পারবেন। গ্রাহক স্বার্থ বিবেচনায় উক্ত নির্দেশনা সংশোধন করে ৫০ জিবি ক্যারি ফরওয়ার্ডের সীমা বাতিল করেছে নিয়ন্ত্রক সংস্থা।\n" +
                "\n" +
                "বৃহস্পতিবার বিকালে বিটিআরসি থেকে পাঠানো এক সংবাদ বিজ্ঞপ্তিতে এই তথ্য জানানো হয়েছে।\n" +
                "\n" +
                "নতুন নিয়ম অনুযায়ী একজন গ্রাহকের ডাটা প্যাকেজের মেয়াদান্তে অব্যবহৃত ডাটা (বোনাসসহ) ক্যারি ফরওয়ার্ড হবে। যদি গ্রাহক উক্ত প্যাকেজের মেয়াদ শেষ হবার পূর্বেই একই ডাটা প্যাকেজ (ভিন্ন ভিন্ন মেয়াদসহ) ক্রয় করেন।\n" +
                "\n" +
                "ইতিমধ্যে সকল মোবাইল অপারেটরসমূহকে এ নির্দেশনা দিয়েছে বিটিআরসি।");

        arrayList.add(hashMap);






    }




    //+++++++++=====================***************+++++=========
    //+++++++++=====================***************+++++=========
    //+++++++++=====================***************+++++=========

}